src/cfe/InformationRegisters/OData4_СчётчикиЗапросов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_СчётчикиЗапросов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Число</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Правило</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НачалоОкна</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/OData4_ТокеныПродолжения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_ТокеныПродолжения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХешТокена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.OData4_Профили</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Набор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Использован</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ХешКлюча</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>64</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/InformationRegisters/OData4_Журнал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>OData4_Журнал</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Время</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сервис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Субъект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Профиль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Метод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Путь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Строк</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Операция</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/CommonModules/OData4_Очистка/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Метод регламентного задания OData4_Очистка: журнал запросов старше СрокХраненияЖурнала дней (0 — журнал
// не очищается), затем счётчики частоты вне окон правил и использованные или просроченные токены
// продолжения. Срок хранения 0 пропускает только журнал: счётчики и токены чистятся при любом сроке.
// Итог каждого шага — в журнал регистрации (событие OData4.Очистка). Шаг, упавший с ошибкой, не мешает
// остальным: ошибка уходит в журнал регистрации.
Процедура ВыполнитьЗадание() Экспорт
	Попытка
		ОчиститьЖурналПоСроку();
	Исключение
		СбойШага("журнал запросов");
	КонецПопытки;
	Попытка
		ОчиститьСчётчики();
	Исключение
		СбойШага("счётчики частоты");
	КонецПопытки;
	Попытка
		ОчиститьТокеныПродолжения();
	Исключение
		СбойШага("токены продолжения");
	КонецПопытки;
	Попытка
		ОчиститьПовторыЗапросов();
	Исключение
		СбойШага("ответы повторяемых запросов");
	КонецПопытки;
КонецПроцедуры

// Удаляет сохранённые ответы повторяемых запросов (регистр OData4_ПовторыЗапросов) с истёкшим сроком хранения.
// Возвращает число записей.
Функция ОчиститьПовторыЗапросов() Экспорт
	Удалено = OData4_ПовторыЗапросов.Очистить();
	ЗаписьЖурналаРегистрации("OData4.Очистка", УровеньЖурналаРегистрации.Информация, , ,
		"Удалено ответов повторяемых запросов с истёкшим сроком: " + Формат(Удалено, "ЧН=0; ЧГ=0"));
	Возврат Удалено;
КонецФункции

// Сбой шага очистки — предупреждение в журнале регистрации; остальные шаги выполняются.
Процедура СбойШага(Название)
	ЗаписьЖурналаРегистрации("OData4.Очистка", УровеньЖурналаРегистрации.Предупреждение, , ,
		"Шаг очистки «" + Название + "» не выполнен: " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
КонецПроцедуры

// Удаляет счётчики частоты (регистр OData4_СчётчикиЗапросов) окон, которые уже не проверяются: старше
// наибольшего окна правил частоты всех профилей (правил нет — все счётчики). Возвращает число записей.
Функция ОчиститьСчётчики() Экспорт
	Окно = OData4_Безопасность.НаибольшееОкноЧастоты();
	Граница = (ТекущаяУниверсальнаяДата() - Дата(1, 1, 1)) - Окно;
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	С.Субъект КАК Субъект,
		|	С.Правило КАК Правило,
		|	С.НачалоОкна КАК НачалоОкна
		|ИЗ
		|	РегистрСведений.OData4_СчётчикиЗапросов КАК С
		|ГДЕ
		|	С.НачалоОкна < &Граница");
	Запрос.УстановитьПараметр("Граница", Граница);
	Строки = OData4_Хранилище.ВыполнитьЗапрос(Запрос).Выгрузить();
	Удалено = 0;
	Для Каждого Строка0 Из Строки Цикл
		Набор = РегистрыСведений.OData4_СчётчикиЗапросов.СоздатьНаборЗаписей();
		Набор.Отбор.Субъект.Установить(Строка0.Субъект);
		Набор.Отбор.Правило.Установить(Строка0.Правило);
		Набор.Отбор.НачалоОкна.Установить(Строка0.НачалоОкна);
		ЗаписатьТехнически(Набор);
		Удалено = Удалено + 1;
	КонецЦикла;
	ЗаписьЖурналаРегистрации("OData4.Очистка", УровеньЖурналаРегистрации.Информация, , ,
		"Удалено счётчиков частоты вне окна " + Формат(Окно, "ЧН=0; ЧГ=0") + " с: " + Формат(Удалено, "ЧН=0; ЧГ=0"));
	Возврат Удалено;
КонецФункции

// Удаляет токены продолжения (регистр OData4_ТокеныПродолжения) с истёкшим сроком или уже использованные.
// Возвращает число записей.
Функция ОчиститьТокеныПродолжения() Экспорт
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Т.ХешКлюча КАК ХешКлюча
		|ИЗ
		|	РегистрСведений.OData4_ТокеныПродолжения КАК Т
		|ГДЕ
		|	Т.Использован
		|	ИЛИ Т.Срок <= &Сейчас");
	Запрос.УстановитьПараметр("Сейчас", ТекущаяУниверсальнаяДата());
	Строки = OData4_Хранилище.ВыполнитьЗапрос(Запрос).Выгрузить();
	Удалено = 0;
	Для Каждого Строка0 Из Строки Цикл
		Набор = РегистрыСведений.OData4_ТокеныПродолжения.СоздатьНаборЗаписей();
		Набор.Отбор.ХешКлюча.Установить(Строка0.ХешКлюча);
		ЗаписатьТехнически(Набор);
		Удалено = Удалено + 1;
	КонецЦикла;
	ЗаписьЖурналаРегистрации("OData4.Очистка", УровеньЖурналаРегистрации.Информация, , ,
		"Удалено токенов продолжения (использованных и просроченных): " + Формат(Удалено, "ЧН=0; ЧГ=0"));
	Возврат Удалено;
КонецФункции

// Запись технического набора расширения: контроль удаляемых объектов БСП не выполняется (решение
// контроллера 5.2 — подписке нужны права, которых у пользователя сервиса может не быть).
Процедура ЗаписатьТехнически(Набор)
	Набор.ДополнительныеСвойства.Вставить("НеВыполнятьКонтрольУдаляемых", Истина);
	Набор.Записать();
КонецПроцедуры

// Удаляет записи журнала старше срока хранения; срок 0 — журнал не трогается.
Процедура ОчиститьЖурналПоСроку() Экспорт
	Срок = OData4_НастройкиСервиса.Прочитать().СрокХраненияЖурнала;
	Если Срок = 0 Тогда
		ЗаписьЖурналаРегистрации("OData4.Очистка", УровеньЖурналаРегистрации.Информация, , ,
			"Журнал запросов не очищается: срок хранения 0");
		Возврат;
	КонецЕсли;
	Граница = ТекущаяУниверсальнаяДатаВМиллисекундах() - Срок * 86400000;
	Удалено = ОчиститьЖурнал(Граница);
	ЗаписьЖурналаРегистрации("OData4.Очистка", УровеньЖурналаРегистрации.Информация, , ,
		"Удалено записей журнала запросов старше " + Формат(Срок, "ЧГ=0") + " дн.: " + Формат(Удалено, "ЧН=0; ЧГ=0"));
КонецПроцедуры

// Удаляет записи журнала со временем меньше Граница (мс UTC); по 200 значений времени на транзакцию:
// блокировки короткие, запись журнала запросов их ждёт.
// Возвращает число удалённых записей.
Функция ОчиститьЖурнал(Граница) Экспорт
	Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	Ж.Время КАК Время,
		|	КОЛИЧЕСТВО(*) КАК Записей
		|ИЗ
		|	РегистрСведений.OData4_Журнал КАК Ж
		|ГДЕ
		|	Ж.Время < &Граница
		|
		|СГРУППИРОВАТЬ ПО
		|	Ж.Время");
	Запрос.УстановитьПараметр("Граница", Граница);
	Выборка = Запрос.Выполнить().Выбрать();
	Удалено = 0;
	Пока Истина Цикл
		Пачка = 0;
		НачатьТранзакцию();
		Попытка
			Пока Пачка < 200 И Выборка.Следующий() Цикл
				Набор = РегистрыСведений.OData4_Журнал.СоздатьНаборЗаписей();
				Набор.Отбор.Время.Установить(Выборка.Время);
				ЗаписатьТехнически(Набор);
				Пачка = Пачка + 1;
				Удалено = Удалено + Выборка.Записей;
			КонецЦикла;
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			ВызватьИсключение;
		КонецПопытки;
		Если Пачка < 200 Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	Возврат Удалено;
КонецФункции

#КонецОбласти
